
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.Товары.Записывать = Истина; 
	
	СуммаПоДокументу = 0;
	
	Для Каждого ТекСтрокаТовары из Товары Цикл
		Движение = Движения.Товары.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Товар = ТекСтрокаТовары.Товар;
		Движение.Количество = ТекСтрокаТовары.Количество;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
		Записать();
		
		СуммаПоДокументу = СуммаПоДокументу + ТекСтрокаТовары.Сумма;
	КонецЦикла;
	
	Движения.ДоходыИРасходы.Записывать = Истина;
	Движение = Движения.ДоходыИРасходы.Добавить();
	Движение.Период = Дата;
	Движение.Статья = Справочники.ДоходыИРасходы.РасходНаПокупкуТовара;
	Движение.СуммаПоСтатье = СуммаПоДокументу;
	Движение.Вид = Перечисления.ВидСтатьи.Расход;
	Записать();

КонецПроцедуры
