&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ИнициализироватьПланировщик();
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Дата = ТекущаяДата();
	
КонецПроцедуры


&НаКлиенте
Процедура Инициализировать(Команда)
	ИнициализироватьПланировщик();
КонецПроцедуры


&НаКлиенте
Процедура ИнициализироватьПланировщик()  
	
	ПоказатьОповещениеПользователя("Выполняется инициализация планировщика.",,, БиблиотекаКартинок.Сегодня);
	
	ИнициализироватьПланировщикНаСервере();
	
	ПоказатьОповещениеПользователя("Планировщик инициализирован.",,, БиблиотекаКартинок.Сегодня);
КонецПроцедуры


&НаСервере
Процедура ИнициализироватьПланировщикНаСервере()  
	
	Планировщик.НачалоПериодаОтображения	= НачалоДня(Дата);
	Планировщик.КонецПериодаОтображения		= КонецДня(Дата);
	
	ПериодОтображенияНачало	= Планировщик.НачалоПериодаОтображения + (Константы.ЧасНачалаРабочегоДня.Получить()		- НачалоДня(Константы.ЧасНачалаРабочегоДня.Получить()));
	ПериодОтображенияКонец	= Планировщик.НачалоПериодаОтображения + (Константы.ЧасОкончанияРабочегоДня.Получить()	- НачалоДня(Константы.ЧасОкончанияРабочегоДня.Получить()));
	
	Планировщик.ТекущиеПериодыОтображения.Очистить();
	Планировщик.ТекущиеПериодыОтображения.Добавить(ПериодОтображенияНачало, ПериодОтображенияКонец);
	
	//ПланировщикЗаполнитьИзмерения();
	//ПланировщикЗаполнитьРасписание();
	
КонецПроцедуры
