
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПродажаАбонемента.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПродажаАбонемента КАК ПродажаАбонемента
		|ГДЕ
		|	ПродажаАбонемента.КлубнаяКарта = &КлубнаяКарта";
	
	Запрос.УстановитьПараметр("КлубнаяКарта", КлубнаяКарта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Абонемент = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	УчетПосещаемостиОстатки.КоличествоПосещенийОстаток КАК ОстатокПосещений
		|ИЗ
		|	РегистрНакопления.УчетПосещаемости.Остатки КАК УчетПосещаемостиОстатки
		|ГДЕ
		|	УчетПосещаемостиОстатки.Абонемент = &Абонемент
		|	И УчетПосещаемостиОстатки.КлубнаяКарта = &КлубнаяКарта";
	
	Запрос.УстановитьПараметр("КлубнаяКарта", КлубнаяКарта);
	Запрос.УстановитьПараметр("Абонемент", Абонемент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОстатокПосещений = ВыборкаДетальныеЗаписи.ОстатокПосещений;
	КонецЦикла;
	Если ОстатокПосещений = Неопределено Тогда
		Отказ = Истина;
		ВызватьИсключение("Абонемент закончился");
	Иначе
	
		ОстатокПосещений = ОстатокПосещений - 1;
		
		Если ОстатокПосещений <= 11 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Осталось" + Строка(ОстатокПосещений) + "посещения. Абонемент скоро закончится";
			Сообщение.Сообщить();
		КонецЕсли;
		
		Движения.УчетПосещаемости.Записывать = Истина;
		Движение = Движения.УчетПосещаемости.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Абонемент = Абонемент;
		Движение.КлубнаяКарта = КлубнаяКарта;
		Движение.КоличествоПосещений = 1;
	КонецЕсли;
	
КонецПроцедуры
