
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПродажаАбонемента.Абонементы.(
		|		ВидАбонемента) КАК ВидАбонемента
		|ИЗ
		|	Документ.ПродажаАбонемента КАК ПродажаАбонемента
		|ГДЕ
		|	ПродажаАбонемента.Спортсмен = &Спортсмен";
	
	Запрос.УстановитьПараметр("Спортсмен", Спортсмен);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Абонемент = ВыборкаДетальныеЗаписи.ВидАбонемента;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	УчетПосещаемостиОбороты.КоличествоПосещенийОборот КАК ОстатокПосещений
		|ИЗ
		|	РегистрНакопления.УчетПосещаемости.Обороты КАК УчетПосещаемостиОбороты
		|ГДЕ
		|	УчетПосещаемостиОбороты.Спортсмен = &Спортсмен
		|	И УчетПосещаемостиОбороты.Абонемент = &Абонемент";
	
	Запрос.УстановитьПараметр("Спортсмен", Спортсмен);
	Запрос.УстановитьПараметр("Абонемент", Абонемент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОстатокПосещений = ВыборкаДетальныеЗаписи.ОстатокПосещений;	
	КонецЦикла;
	
	
	ОстатокПосещений = ОстатокПосещений - 1;
	
	Если ОстатокПосещений <= 3 Тогда
		Сообщить("Осталось" + ОстатокПосещений + "посещения");
	КонецЕсли;
	
	Движения.УчетПосещаемости.Записывать = Истина;
	Движение = Движения.УчетПосещаемости.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Спортсмен = Спортсмен;
	Движение.Абонемент = Абонемент;
КонецПроцедуры
