Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ОбщаяСумма = Товар.Итог("Сумма");
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПродажаТовараТовар.Товар КАК Товар,
		|	СУММА(ПродажаТовараТовар.Количество) КАК Количество,
		|	ПродажаТовараТовар.Сумма
		|ПОМЕСТИТЬ ВТДокумента
		|ИЗ
		|	Документ.ПродажаТовара.Товар КАК ПродажаТовараТовар
		|ГДЕ
		|	ПродажаТовараТовар.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ПродажаТовараТовар.Товар,
		|	ПродажаТовараТовар.Сумма
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Товар
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыОстатки.Товар,
		|	ТоварыОстатки.КоличествоОстаток,
		|	ТоварыОстатки.СуммаОстаток
		|ПОМЕСТИТЬ ВТОстаткиТовара
		|ИЗ
		|	РегистрНакопления.Товары.Остатки КАК ТоварыОстатки
		|ГДЕ
		|	ТоварыОстатки.Товар В
		|		(ВЫБРАТЬ
		|			ВТДокумента.Товар
		|		ИЗ
		|			ВТДокумента КАК ВТДокумента)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТДокумента.Товар,
		|	ВТДокумента.Количество,
		|	ЕСТЬNULL(ВТОстаткиТовара.КоличествоОстаток, 0) КАК КоличествоОстаток,
		|	ЕСТЬNULL(ВТОстаткиТовара.СуммаОстаток, 0) КАК СуммаОстаток,
		|	ВТДокумента.Сумма КАК Сумма
		|ИЗ
		|	ВТДокумента КАК ВТДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОстаткиТовара КАК ВТОстаткиТовара
		|		ПО ВТДокумента.Товар = ВТОстаткиТовара.Товар";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Количество = ВыборкаДетальныеЗаписи.Количество;
		ОстатокТовара = ВыборкаДетальныеЗаписи.КоличествоОстаток;
		Если Количество > ОстатокТовара Тогда
			ВызватьИсключение("Вы не можете продать товар в таком количества. Остаток товара на складе:" + ВыборкаДетальныеЗаписи.КоличествоОстаток)
		Иначе 
			Движения.Товары.Записывать = Истина;
			Движение = Движения.Товары.Добавить();
			Движение.Период = Дата;
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Товар = ВыборкаДетальныеЗаписи.Товар;
			Движение.Количество = ВыборкаДетальныеЗаписи.Количество;
			Движение.Сумма = ВыборкаДетальныеЗаписи.Сумма;
			Записать();
			
			Движения.ДоходыИРасходы.Записывать = Истина;
			Движение = Движения.ДоходыИРасходы.Добавить();
			Движение.Период = Дата;
			Движение.Статья = Справочники.ДоходыИРасходы.ВыручкаОтПродажиТоваров;
			Движение.Вид = Перечисления.ВидСтатьи.Доход;
			Движение.СуммаПоСтатье = ВыборкаДетальныеЗаписи.Сумма;
			Записать();
			
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры
