&НаСервере
Процедура ПриЗаписи(Отказ)
    
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|    СостояниеАбонемента.Статус КАК Статус,
	|    СостояниеАбонемента.ДоступноЗаморозок КАК ДоступноЗаморозок,
	|    ПродажаАбонемента.Абонементы.ВозможностьЗаморозки КАК ВозможностьЗаморозки
	|ИЗ
	|    Документ.ПродажаАбонемента КАК ПродажаАбонемента
	|        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеАбонемента КАК СостояниеАбонемента
	|        ПО ПродажаАбонемента.Ссылка = СостояниеАбонемента.Абонемент
	|ГДЕ
	|    ПродажаАбонемента.Ссылка = &Абонемент";
    
	Запрос.УстановитьПараметр("Абонемент", Объект.Абонемент);
	Результат = Запрос.Выполнить().Выбрать();
    
	Если Результат.Следующий() Тогда
		Если НЕ Результат.ВозможностьЗаморозки Тогда
			Отказ = Истина;
			Сообщить("Данный абонемент не поддерживает заморозку");
			Возврат;
        КонецЕсли;
        
        Если Результат.Статус <> Перечисления.СтатусАбонемента.Активен Тогда
			Отказ = Истина;
			Сообщить("Заморозка возможна для активных абонементов!");
			Возврат;
        КонецЕсли;
        
        Если Результат.ДоступноЗаморозок <= 0 Тогда
			Отказ = Истина;
			Сообщить("Лимит заморозок исчерпан!");
			Возврат;
        КонецЕсли;
        
		НаборЗаписей = РегистрыСведений.СостояниеАбонемента.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Абонемент.Установить(Объект.Абонемент);
        
		Если НаборЗаписей.Найти() Тогда
			Запись = НаборЗаписей.Текущая;
			Запись.Статус = Перечисления.СтатусАбонемента.Заморожен;
			Запись.ДатаИзмененияСтатуса = ТекущаяДата();
			Запись.ДоступноЗаморозок = Запись.ДоступноЗаморозок - 1;
			НаборЗаписей.Записать();
		КонецЕсли;
	КонецЕсли;
    
КонецПроцедуры

&НаСервере
Процедура ДатаНачалаПриИзмененииНаСервере()
    
	Если Объект.ДатаНачала <> Неопределено Тогда
		Объект.ДатаОкончания = КонецДня(Объект.ДатаНачала + 90);
    КонецЕсли;
    
КонецПроцедуры