&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	Количество = Элементы.Товары.ТекущиеДанные.Количество;
	Цена = Элементы.Товары.ТекущиеДанные.ЦенаПоступления;
	Элементы.Товары.ТекущиеДанные.Сумма = Цена * Количество;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЦену(Товар, Дата)
	Отбор = Новый Структура("Товар", Товар);
	ЦенаТовара = РегистрыСведений.ЦенаТовара.ПолучитьПоследнее(Дата, Отбор);	
	Возврат ЦенаТовара.Цена 
	
КонецФункции

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	Товар = Элементы.Товары.ТекущиеДанные.Товар;
	Цена = ПолучитьЦену(Товар, Объект.Дата);
	Элементы.Товары.ТекущиеДанные.ЦенаПоступления = Цена;
	Количество = Элементы.Товары.ТекущиеДанные.Количество;
	Элементы.Товары.ТекущиеДанные.Сумма = Цена * Количество;
КонецПроцедуры
