Процедура ОбработкаПроведения(Отказ, РежимПроведения)
  Запрос = Новый Запрос;
  Запрос.Текст = 
    "ВЫБРАТЬ
    |  РегистрацияДоходовИРасходов.СтатьяДоходаИРасхода КАК Статья,
    |  РегистрацияДоходовИРасходов.СтатьяДоходаИРасхода.Вид КАК Вид,
    |  РегистрацияДоходовИРасходов.Сумма КАК СуммаПоСтатье,
    |  РегистрацияДоходовИРасходов.Дата КАК Период

    |ИЗ
    |  Документ.РегистрацияДоходовИРасходов КАК РегистрацияДоходовИРасходов
    |ГДЕ
    |  РегистрацияДоходовИРасходов.Ссылка = &Ссылка";
  
  Запрос.УстановитьПараметр("Ссылка", Ссылка);
  
  РезультатЗапроса = Запрос.Выполнить();
  
  ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
  
  Движения.ДоходыИРасходы.Записывать = Истина;
  
  Пока ВыборкаДетальныеЗаписи.Следующий()Цикл
//    Движение = Движения.ДоходыИРасходы.Добавить();
    ЗаполнитьЗначенияСвойств(Движения.ДоходыИРасходы.Добавить(), ВыборкаДетальныеЗаписи);
//    Движение.Период = Ссылка.Дата;
  КонецЦикла;
КонецПроцедуры