
&НаСервере
Процедура КлубнаяКартаПриИзмененииНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Спортсмены.Ссылка КАК Спортсмен
		|ИЗ
		|	Справочник.Спортсмены КАК Спортсмены
		|ГДЕ
		|	Спортсмены.КлубнаяКарта = &КлубнаяКарта";
	
	Запрос.УстановитьПараметр("КлубнаяКарта", Объект.КлубнаяКарта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Объект.Спортсмен = ВыборкаДетальныеЗаписи.Спортсмен;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КлубнаяКартаПриИзменении(Элемент)
	КлубнаяКартаПриИзмененииНаСервере()	
КонецПроцедуры
