Процедура ОбработкаПроведения(Отказ, РежимПроведения)
    
    
        
        Если Не ПроверитьВозможностьЗаморозки() Тогда
            Отказ = Истина;
            Возврат;
        КонецЕсли;
        
        ОбновитьСтатусАбонемента(Перечисления.СтатусАбонемента.Заморожен);
        
КонецПроцедуры



Функция ПроверитьВозможностьЗаморозки()
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    СостояниеАбонемента.Статус КАК Статус,
    |    СостояниеАбонемента.ДоступноЗаморозок КАК ДоступноЗаморозок,
    |    СостояниеАбонемента.ДатаОкончания КАК ДатаОкончанияАбонемента
    |ИЗ
    |    РегистрСведений.СостояниеАбонемента КАК СостояниеАбонемента
    |ГДЕ
    |    СостояниеАбонемента.Абонемент = &Абонемент";
    
    Запрос.УстановитьПараметр("Абонемент", Абонемент);
    Результат = Запрос.Выполнить().Выбрать();
    
    Если НЕ Результат.Следующий() Тогда
        Сообщить("Абонемент не найден в регистре состояний");
        Возврат Ложь;
    КонецЕсли;
    
    Если Результат.Статус <> Перечисления.СтатусАбонемента.Активен Тогда
        Сообщить("Заморозка возможна только для активных абонементов");
        Возврат Ложь;
    КонецЕсли;
    
    Если Результат.ДоступноЗаморозок <= 0 Тогда
        Сообщить("Лимит заморозок исчерпан");
        Возврат Ложь;
    КонецЕсли;
    
    Если Результат.ДатаОкончанияАбонемента <> Неопределено 
        И Результат.ДатаОкончанияАбонемента < ТекущаяДата() Тогда
		Сообщить("Абонемент уже закрыт");
        Возврат Ложь;
    КонецЕсли;
    Сообщить(ДатаОканчания);
    Сообщить(ДатаНачала);
    СрокЗаморозки = ДатаОканчания - ДатаНачала;
    Если СрокЗаморозки > 90 Тогда 
		Сообщить("Срок заморозки не может превышать 3 месяцев");
        Возврат Ложь;
    КонецЕсли;
    
    Возврат Истина;
    
КонецФункции


Процедура ОбновитьСтатусАбонемента(НовыйСтатус)
    
    НаборЗаписей = РегистрыСведений.СостояниеАбонемента.СоздатьНаборЗаписей();
    НаборЗаписей.Отбор.Абонемент.Установить(Абонемент);
    НаборЗаписей.Прочитать();
    
    Если НаборЗаписей.Количество() = 0 Тогда
        Запись = НаборЗаписей.Добавить();
        Запись.Абонемент = Абонемент;
    Иначе
        Запись = НаборЗаписей[0];
    КонецЕсли;
    
    Запись.Статус = НовыйСтатус;
    Запись.ДатаИзменения = ТекущаяДата();
    
    Если НовыйСтатус = Перечисления.СтатусАбонемента.Заморожен Тогда
        Запись.ДоступноЗаморозок = Макс(0, Запись.ДоступноЗаморозок - 1);
    ИначеЕсли НовыйСтатус = Перечисления.СтатусАбонемента.Активен Тогда
        Запись.ДоступноЗаморозок = Запись.ДоступноЗаморозок + 1;
    КонецЕсли;
    
    НаборЗаписей.Записать();
    
КонецПроцедуры

