
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Для Каждого Стр из Абонементы Цикл
		Абонемент = Стр.ВидАбонемента;
		КоличествоПосещений = Стр.КоличествоПосещений;
	КонецЦикла; 
	
	Движения.УчетПосещаемости.Записывать = Истина;
	Движение = Движения.УчетПосещаемости.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Абонемент = Абонемент;
	Движение.Период = Дата;
	Движение.Спортсмен = Спортсмен;
	Движение.КоличествоПосещений = КоличествоПосещений;
КонецПроцедуры
