Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если ЗначениеЗаполнено(ЭтотОбъект.ВидАбонемента) Тогда
        Запрос = Новый Запрос;
        Запрос.Текст = 
        "ВЫБРАТЬ ПЕРВЫЕ 1
        |    ВидыАбонементов.ДлительностьДней,
        |    ВидыАбонементов.ДлительностьМесяцев,
        |    ВидыАбонементов.КоличествоПосещений,
        |    ВидыАбонементов.ОграничениеДлительности
        |ИЗ
        |    Справочник.ВидыАбонементов КАК ВидыАбонементов
        |ГДЕ
        |    ВидыАбонементов.Ссылка = &ВидАбонемента";
        
        Запрос.УстановитьПараметр("ВидАбонемента", ЭтотОбъект.ВидАбонемента);
        
        РезультатЗапроса = Запрос.Выполнить();
        Выборка = РезультатЗапроса.Выбрать();
        
		Если Выборка.Следующий() Тогда
            ДлительностьМесяцев = Выборка.ДлительностьМесяцев;
            ДлительностьДней = Выборка.ДлительностьДней;
            ДатаСДобавленнымиМесяцами = ДобавитьМесяц(ТекущаяДата(), ДлительностьМесяцев);
			ДатаОкончания = КонецДня(ДатаСДобавленнымиМесяцами+ 86400*ДлительностьДней);
            ОбщееКоличествоПосещений = Выборка.КоличествоПосещений;
        КонецЕсли;
    КонецЕсли;
	
	Для Каждого Стр из Абонементы Цикл
		КоличествоПосещений = Стр.КоличествоПосещений;
		МенеджерЗаписиСостояние = РегистрыСведений.СостояниеАбонемента.СоздатьМенеджерЗаписи();
		МенеджерЗаписиСостояние.Период = ЭтотОбъект.Дата;
		МенеджерЗаписиСостояние.Абонемент = Ссылка;
		ДоступноЗаморозок = 0;
		Если ЭтотОбъект.Абонементы.Количество() > 0 Тогда
		    ДоступноЗаморозок = ЭтотОбъект.Абонементы[0].ДоступноеКоличествоЗаморозок;
		КонецЕсли;
		МенеджерЗаписиСостояние.Статус = Перечисления.СтатусАбонемента.Активен;
		МенеджерЗаписиСостояние.ДатаИзменения = ТекущаяДата(); 
		МенеджерЗаписиСостояние.ОстатокПосещений = ОбщееКоличествоПосещений;
		МенеджерЗаписиСостояние.ДатаОкончания = ДатаОкончания;
		МенеджерЗаписиСостояние.ДоступноЗаморозок = ДоступноЗаморозок;
		МенеджерЗаписиСостояние.Записать();
		
		Движения.ПродажиТренеров.Записывать = Истина;
		ДвижениеПродажи = Движения.ПродажиТренеров.Добавить();
        ДвижениеПродажи.Период = Дата;
        ДвижениеПродажи.ВидДвижения = ВидДвиженияНакопления.Приход;
        ДвижениеПродажи.Тренер = Стр.Тренер;  
        ДвижениеПродажи.Услуга = Стр.Услуга;
        ДвижениеПродажи.Сумма = Стр.Сумма;
		
	КонецЦикла; 
	
	Движения.УчетПосещаемости.Записывать = Истина;
	Движение = Движения.УчетПосещаемости.Добавить();
	Движение.Период = Дата;
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Абонемент = Ссылка;
	Движение.КлубнаяКарта = КлубнаяКарта;
	Движение.КоличествоПосещений = КоличествоПосещений;

КонецПроцедуры
