Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Для Каждого Стр из Абонементы Цикл
		КоличествоПосещений = Стр.КоличествоПосещений;
		
		ЗапросПроверка = Новый Запрос;
		ЗапросПроверка.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СостояниеАбонемента.Абонемент
		|ИЗ
		|	РегистрСведений.СостояниеАбонемента КАК СостояниеАбонемента
		|ГДЕ
		|	СостояниеАбонемента.Абонемент = &Абонемент";
		
		ЗапросПроверка.УстановитьПараметр("Абонемент", Ссылка);
		
		РезультатПроверки = ЗапросПроверка.Выполнить();
		Выборка = РезультатПроверки.Выбрать();
		
		Если Выборка.Следующий() Тогда
			ЗапросУдалить = Новый Запрос;
			ЗапросУдалить.Текст = 
			"УДАЛИТЬ ИЗ
			|	РегистрСведений.СостояниеАбонемента
			|ГДЕ
			|	Абонемент = &Абонемент";
			
			ЗапросУдалить.УстановитьПараметр("Абонемент", Ссылка);
			ЗапросУдалить.Выполнить();
		КонецЕсли;
		ДатаОкончания = КонецДня(ДатаОкончания + Стр.ДнейДлительность + 30* Стр.МесяцевДлительность);
		ДоступноЗаморозок = Стр.ДоступноеКоличествоЗаморозок;
        НаборЗаписей = РегистрыСведений.СостояниеАбонемента.СоздатьНаборЗаписей();
		Запись = НаборЗаписей.Добавить();
		Запись.Абонемент = Ссылка;
        Запись.Статус = Перечисления.СтатусАбонемента.Активен;
        Запись.ДатаИзменения = ТекущаяДата();
        Запись.ОстатокПосещений = Стр.КоличествоПосещений;
        Запись.ДатаОкончания = ДатаОкончания;
        Запись.ДоступноЗаморозок = ДоступноЗаморозок; 
        
        НаборЗаписей.Записать();
		
		Движения.ПродажиТренеров.Записывать = Истина;
		ДвижениеПродажи = Движения.ПродажиТренеров.Добавить();
        ДвижениеПродажи.Период = Дата;
        ДвижениеПродажи.ВидДвижения = ВидДвиженияНакопления.Приход;
        ДвижениеПродажи.Тренер = Стр.Тренер;  
        ДвижениеПродажи.Услуга = Стр.Услуга;
        ДвижениеПродажи.Сумма = Стр.Сумма;
		
	КонецЦикла; 
	
	Движения.УчетПосещаемости.Записывать = Истина;
	Движение = Движения.УчетПосещаемости.Добавить();
	Движение.Период = Дата;
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Абонемент = Ссылка;
	Движение.КлубнаяКарта = КлубнаяКарта;
	Движение.КоличествоПосещений = КоличествоПосещений;

КонецПроцедуры
