
&НаКлиенте
Процедура Оплатить(Команда)
	Если Не Объект.Проведен Тогда
        ВызватьИсключение(, "Документ должен быть проведен перед оплатой");
	КонецЕсли;
    ПараметрыФормы = Новый Структура; 
    ПараметрыФормы.Вставить("Основание", Объект.Ссылка); 
    ОткрытьФорму("Документ.Оплата.Форма.ФормаДокумента", ПараметрыФормы); 
КонецПроцедуры


&НаКлиенте
Процедура ТоварЦенаПродажиПриИзменении(Элемент)
	Количество = Элементы.Товар.ТекущиеДанные.Количество;
	Цена = Элементы.Товар.ТекущиеДанные.ЦенаПродажи;
	Элементы.Товар.ТекущиеДанные.Сумма = Цена * Количество;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЦенуТовара(Товар, Дата)
	Отбор = Новый Структура("Товар", Товар);
	ЦенаТовара = РегистрыСведений.ЦенаТовара.ПолучитьПоследнее(Дата, Отбор);	
	СтоимостьТовара = ЦенаТовара.Цена;
	
	Отбор = Новый Структура("Товар", Товар);
	Наценка = РегистрыСведений.НаценкаТовара.ПолучитьПоследнее(Дата, Отбор);	
	ПроцентНаценки = Наценка.ПроцентНаценки; 
	
	Цена = СтоимостьТовара + (СтоимостьТовара * (ПроцентНаценки / 100));
	Возврат цена
КонецФункции

&НаКлиенте
Процедура ТоварКоличествоПриИзменении(Элемент)
	Товар = Элементы.Товар.ТекущиеДанные.Товар;
	Дата = Объект.Дата;
	Цена = ПолучитьЦенуТовара(Товар, Дата);
	Элементы.Товар.ТекущиеДанные.ЦенаПродажи = Цена;
	Количество = Элементы.Товар.ТекущиеДанные.Количество;
	Элементы.Товар.ТекущиеДанные.Сумма = Цена * Количество;
КонецПроцедуры
