&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Если ТипЗнч(Параметры.Основание) = Тип("ДокументСсылка.ПродажаАбонемента") Тогда
    	Если ЕстьОплатаПоОснованию(Параметры.Основание) Тогда
            Отказ = Истина;
            Сообщить("По данному основанию уже есть оплата");
            Возврат;
        КонецЕсли;
        Объект.Основание = Параметры.Основание;
        Объект.Спортсмен = Параметры.Основание.Спортсмен;
        Объект.Кассир = Справочники.Пользователи.НайтиПоНаименованию(ИмяПользователя());
        Объект.Дата = ТекущаяДата();
        ЗаполнитьУслугиИВычислитьСумму(Параметры.Основание);
    КонецЕсли;
    
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУслугиИВычислитьСумму(Продажа)
    Объект.Услуги.Очистить();
    ОбщаяСумма = 0;
    Для Каждого СтрокаПродажи Из Продажа.Абонементы Цикл
        НоваяСтрока = Объект.Услуги.Добавить();
        НоваяСтрока.Услуга = СтрокаПродажи.Услуга;
        НоваяСтрока.Сумма = СтрокаПродажи.Сумма;
        Если СтрокаПродажи.Сумма <> Неопределено Тогда
            ОбщаяСумма = ОбщаяСумма + СтрокаПродажи.Сумма;
        КонецЕсли;
    КонецЦикла;
    Объект.Сумма = ОбщаяСумма;
КонецПроцедуры

&НаКлиенте
Процедура НапечататьЧек(Команда)
	Если Не Объект.Проведен Тогда
        ПоказатьПредупреждение(, "Документ должен быть проведен перед печатью чека");
        Возврат;
    КонецЕсли;
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.ДобавитьСтроку("------------------------------------------------");
	Если НЕ ЗначениеЗаполнено(Объект.Дата) Тогда
		ТекстовыйДокумент.ДобавитьСтроку("Предварительный чек, оплата не завершена");
	КонецЕсли;
	ТекстовыйДокумент.ДобавитьСтроку("Чек:  " + Объект.Номер + "			" + Формат(Объект.Дата, "ДЛФ=ДВ"));
	ТекстовыйДокумент.ДобавитьСтроку("Кассир: " + Объект.Кассир);
	Если ЗначениеЗаполнено(Объект.Основание) Тогда
		ТекстовыйДокумент.ДобавитьСтроку("Основание: " + Объект.Основание);
	КонецЕсли;
	ТекстовыйДокумент.ДобавитьСтроку("------------------------------------------------");
	Услуги = Объект.Услуги;
	Для Каждого Позиция из Услуги Цикл
	    ТекстовыйДокумент.ДобавитьСтроку("Услуга: " + Позиция.Услуга +  " Сумма " + Позиция.Сумма);
	КонецЦикла;
	ТекстовыйДокумент.ДобавитьСтроку("================================================");
		ТекстовыйДокумент.ДобавитьСтроку("Способ оплаты: " + Объект.СпособОплаты);
	ТекстовыйДокумент.ДобавитьСтроку("Итого:  " + Объект.Сумма + " Руб.");
	
	ТекстовыйДокумент.Показать("Чек оплаты №" + Объект.Номер);
КонецПроцедуры

&НаСервере
Функция ЕстьОплатаПоОснованию(Основание)
    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ ПЕРВЫЕ 1
        |    Оплата.Ссылка КАК Ссылка
        |ИЗ
        |    Документ.Оплата КАК Оплата
        |ГДЕ
        |    Оплата.Основание = &Основание";
    Запрос.УстановитьПараметр("Основание", Основание);
    Результат = Запрос.Выполнить().Выбрать();
    Возврат Результат.Следующий();
КонецФункции
