Процедура ЗаполнитьПервоначальныеПараметры() Экспорт 
	
	Если Константы.ЧасНачалаРабочегоДня.Получить() = Дата(1,1,1) Тогда
		Константы.ЧасНачалаРабочегоДня.Установить(Дата(1,1,1,9,0,0));
	КонецЕсли;
	Если Константы.ЧасОкончанияРабочегоДня.Получить() = Дата(1,1,1) Тогда
		Константы.ЧасОкончанияРабочегоДня.Установить(Дата(1,1,1,18,0,0));
	КонецЕсли;
	Если Константы.КомиссияБанкаЭквайера.Получить() = 0 Тогда
		Константы.КомиссияБанкаЭквайера.Установить(1.257);
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьПервоначальныеПараметры