Процедура ОбработкаПроведения(Отказ,Режим)
	
	СуммаПоДокументу = Услуги.Итог("Сумма");
	
	Если СпособОплаты = Перечисления.СпособОплаты.Карта Тогда
		
		Комиссия = СуммаПоДокументу / 100 * Константы.КомиссияБанкаЭквайера.Получить();
		СуммаДохода = СуммаПоДокументу - Комиссия;
		
		// регистр ДоходыИРасходы
		Движения.ДоходыИРасходы.Записывать = Истина;
		Движение = Движения.ДоходыИРасходы.Добавить();
		Движение.Период = Дата;
		Движение.Статья = Справочники.ДоходыИРасходы.КомиссияБанкуЭквайеру;
		Движение.Вид = Перечисления.ВидСтатьи.Расход;
		Движение.СуммаПоСтатье = Комиссия;
	
		Записать();
		
	Иначе
		
		СуммаДохода = СуммаПоДокументу;
		
	КонецЕсли;
	
	// регистр ДоходыИРасходы
	Движения.ДоходыИРасходы.Записывать = Истина;
	Движение = Движения.ДоходыИРасходы.Добавить();
	Движение.Период = Дата;
	Движение.Статья = Справочники.ДоходыИРасходы.ОплатаОтКлиента;
	Движение.Вид = Перечисления.ВидСтатьи.Доход;
	Движение.СуммаПоСтатье = СуммаДохода;

	Записать();
	
КонецПроцедуры